meme_dict = {
    "КРИНЖ": "Что-то очень странное или стыдное",
    "ДОЛ": "Что-то очень смешное",
    "РОФЛ": "Шутка или розыгрыш",
    "ЩИЩ": "Одобрение или восторг",
    "КРИПОВЫЙ": "Страшный, пугающий",
    "АГРИТЬСЯ": "Злиться",
    "ХАЙП": "Шум вокруг чего-то популярного",
    "ИМБА": "Что-то очень крутое и сильное"
}

for _ in range(5):
    word = input("Введите непонятное слово (большими буквами!): ")
    if word in meme_dict:
        print(meme_dict[word])
    else:
        print("Такого слова нет в словаре.")

print("Спасибо, что воспользовался словарём!")
